import { useRef, useState } from "react";

function App() {
  const [name, setName] = useState("");

  const inputNameRef = useRef(null);
  const lastParagraphRef = useRef(null);

  const scrollToLastParagraph = () => {
    lastParagraphRef.current.scrollIntoView({
      behavior: "smooth",
      block: "end",
    });
  };

  return (
    <>
      <h1>useState</h1>
      <input
        type="text"
        value={name}
        onChange={(event) => {
          console.log("event:", event);
          setName(event.target.value);
        }}
      />
      <h2>{name}</h2>
      <br />
      <h1>useRef</h1>
      <input
        ref={inputNameRef}
        type="text"
        // value={inputNameRef.current}
        onChange={(event) => {
          inputNameRef.current.value = event.target.value;
        }}
      />
      <h2>{inputNameRef.current?.value}</h2>
      <br />

      <button onClick={scrollToLastParagraph}>Bottom</button>

      <p>
        อยุติธรรมแรลลีแดนเซอร์แพนด้าเบนโล แอดมิสชันสเปกร็อคผิดพลาด
        โรแมนติคฮ็อตด็อกผู้นำ สเกตช์รอยัลตี้ปูอัด สังโฆ สแควร์ม้านั่งวีน ป๊อป
        ฟลุก ไกด์โซลาร์คำตอบรีไซเคิลเทเลกราฟ วอร์รูมซูชิโชห่วย เย้ว บ๊วยแคป
        เลสเบี้ยนโฮปคณาญาติ ถ่ายทำแอปเปิ้ลสามช่า แพทเทิร์นมาราธอนฮ็อต
        ตัวตนเบนโลซามูไรสเกตช์
      </p>
      <p>
        ซูชิ ไดเอ็ตตอกย้ำแพนดาบึมสติกเกอร์ ซาร์ธรรมาวิวโค้ชเอ๊าะ
        แคร์เมเปิลห่วยรูบิกหมั่นโถว ตุ๊กวอลซ์เกจิช็อคจังโก้
        แจ็กพ็อตสะกอมธุหร่ำพรีเมียร์ ไทม์เยลลี่ฮอตดอกฮวงจุ้ย
        แอปเปิลแชมเปี้ยนเจี๊ยวเพรียวบางผลักดัน สเตย์เลสเบี้ยนรีพอร์ทกระดี๊กระด๊า
        โคโยตีโต๋เต๋บึม โกะ เซ่นไหว้เบนโลอัลตราจ๊าบเคอร์ฟิว โปลิศซัมเมอร์ฮ่องเต้
        อพาร์ตเมนท์นินจาเฟรชชี่เฉิ่มโปลิศ เยลลี่ จึ๊กฮาร์ดพูล
      </p>
      <p>
        บ๊วย ซิลเวอร์ บึ้มปิกอัพฮิเต๊ะ แฟ้บ วอลนัต มลภาวะโฮลวีต
        สเกตช์ภูมิทัศน์เสือโคร่งกษัตริยาธิราช ไบโอวาทกรรมแคป
        ไฮเทคดีพาร์ทเมนต์กรุ๊ปวีเจ ตรวจทานราชบัณฑิตยสถานแซลมอนวีเจสตูดิโอ
        แดรี่วัจนะ เจไดวอฟเฟิลไฮแจ็ค อุปัทวเหตุโฮปขั้นตอนคอนแท็ค
        ปฏิสัมพันธ์อาร์พีจี แฮปปี้มอลล์ โกเต็กซ์
      </p>
      <p>
        ถ่ายทำแตงโมอ่อนด้อย เฟรชชีสสเปก แดรี่รีพอร์ทซามูไรแจ็กพ็อตเต๊ะ
        รีพอร์ทสเตริโอสเตอริโอรูบิคสปอร์ต เป็นไง
        ริคเตอร์โนติสแจ๊กพ็อตพันธุวิศวกรรมอะ บ๋อย
        เอ็นจีโอโปรโมชั่นสเตชั่นติ๋มชัวร์ ทาวน์เวิลด์เช็กอุปสงค์ เลสเบี้ยนยูโร
        เพนกวินโฮสเตสคอนเทนเนอร์ คอมเมนท์มอยส์เจอไรเซอร์
        บ๊อกซ์โหงวเฮ้งโปสเตอร์เกจิดีไซน์ เทคสต๊อคพีเรียดโพสต์นายพราน
        แฟรนไชส์ด็อกเตอร์รุมบ้ารีเสิร์ชฮิปฮอป
        ซัมเมอร์สันทนาการติ่มซำอวอร์ดฮัลโหล
      </p>
      <p>
        สุริยยาตร์หงวนวอเตอร์เทปเมี่ยงคำ ดิกชันนารีโอเพ่นเทวา พลาซ่าเบอร์รี
        ไตรมาส ตู้เซฟไตรมาสพะเรอ เวิร์กป๊อกเทคโน
        ซัมเมอร์เวิลด์อมาตยาธิปไตยม้านั่ง เรซิ่นอุเทนพันธกิจแพ็ค
        สเปกสติ๊กเกอร์เอสเปรสโซ ไดเอ็ตท็อปบู๊ทแดนเซอร์พริตตี้
        ผลักดันพาสปอร์ตมาร์ค แซลมอนดิกชันนารีโปรเจ็คเฟรชชี่
        เฟรมลาเต้แจ๊กเก็ตแพกเกจ บร็อคโคลีแหม็บโกเต็กซ์คีตราชัน ฟอยล์บุ๋น ออยล์
      </p>
      <p>
        สุริยยาตร์หงวนวอเตอร์เทปเมี่ยงคำ ดิกชันนารีโอเพ่นเทวา พลาซ่าเบอร์รี
        ไตรมาส ตู้เซฟไตรมาสพะเรอ เวิร์กป๊อกเทคโน
        ซัมเมอร์เวิลด์อมาตยาธิปไตยม้านั่ง เรซิ่นอุเทนพันธกิจแพ็ค
        สเปกสติ๊กเกอร์เอสเปรสโซ ไดเอ็ตท็อปบู๊ทแดนเซอร์พริตตี้
        ผลักดันพาสปอร์ตมาร์ค แซลมอนดิกชันนารีโปรเจ็คเฟรชชี่
        เฟรมลาเต้แจ๊กเก็ตแพกเกจ บร็อคโคลีแหม็บโกเต็กซ์คีตราชัน ฟอยล์บุ๋น ออยล์
      </p>
      <p ref={lastParagraphRef}>
        สุริยยาตร์หงวนวอเตอร์เทปเมี่ยงคำ ดิกชันนารีโอเพ่นเทวา พลาซ่าเบอร์รี
        ไตรมาส ตู้เซฟไตรมาสพะเรอ เวิร์กป๊อกเทคโน
        ซัมเมอร์เวิลด์อมาตยาธิปไตยม้านั่ง เรซิ่นอุเทนพันธกิจแพ็ค
        สเปกสติ๊กเกอร์เอสเปรสโซ ไดเอ็ตท็อปบู๊ทแดนเซอร์พริตตี้
        ผลักดันพาสปอร์ตมาร์ค แซลมอนดิกชันนารีโปรเจ็คเฟรชชี่
        เฟรมลาเต้แจ๊กเก็ตแพกเกจ บร็อคโคลีแหม็บโกเต็กซ์คีตราชัน ฟอยล์บุ๋น ออยล์
      </p>
    </>
  );
}

export default App;
